[System.Serializable]
public class Researches
{
    // Researches скорее всего будут храниться в данных отделов
    public int BridgeLevel;
    /*
     * Level - Открывает новый уровень
     * CrewMax - повышает количество работников для найма
     * Systems update - повышает продуктивность работников(Вместо стандартного систем апдейт, будем делать множество апдейтов с разными названиями, типа "обновление ПО на компах ученых", "Усиленные лазеры для инженеров" итд
     * Понижение электропотребления
     * 
     *
     * 
     */
    
    public int RNDLevel;
}
